aaron-bond.better-comments
alefragnani.project-manager
batisteo.vscode-django
bierner.markdown-preview-github-styles
blindtiger.masm
chakrounanas.turbo-console-log
charliermarsh.ruff
christian-kohler.path-intellisense
codezombiech.gitignore
cstrap.flask-snippets
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
docker.docker
donjayamanne.git-extension-pack
donjayamanne.githistory
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
esbenp.prettier-vscode
felipecaputo.git-project-manager
formulahendry.code-runner
foxundermoon.shell-format
franneck94.c-cpp-runner
github.copilot
github.copilot-chat
github.github-vscode-theme
golang.go
google.wireit
gruntfuggly.todo-tree
hashicorp.terraform
hnw.vscode-auto-open-markdown-preview
ibm.output-colorizer
ionutvmi.path-autocomplete
jebbs.plantuml
johnpapa.vscode-peacock
kamikillerto.vscode-colorize
kevinrose.vsc-python-indent
mads-hartmann.bash-ide-vscode
marnix.peacock
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-repositories
natizyskunk.sftp
njpwerner.autodocstring
oderwat.indent-rainbow
peterschmalfeldt.explorer-exclude
pkief.material-icon-theme
pnp.polacode
rapidapi.vscode-rapidapi-client
rapidapi.vscode-services
redhat.vscode-yaml
remisa.shellman
ritwickdey.liveserver
rogalmic.bash-debug
shd101wyy.markdown-preview-enhanced
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
tabnine.tabnine-vscode
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-java-dependency
vscode-icons-team.vscode-icons
waderyan.gitblame
wayou.vscode-todo-highlight
wholroyd.jinja
wix.vscode-import-cost
xsro.masm-tasm
xsro.vscode-dosbox
ziyasal.vscode-open-in-github
